###############################################################################
# Created by write_sdc
###############################################################################
current_design chip_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_PAD -period 20.0000 [get_pins {clk_pad/Y}]
set_clock_transition 0.1500 [get_clocks {clk_PAD}]
set_clock_uncertainty 0.2500 clk_PAD
set_propagated_clock [get_clocks {clk_PAD}]
set_input_delay 0.0000 -clock [get_clocks {clk_PAD}] -min -add_delay [get_ports {bidir_PAD[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk_PAD}] -max -add_delay [get_ports {bidir_PAD[0]}]
set_input_delay 0.0000 -clock [get_clocks {clk_PAD}] -min -add_delay [get_ports {input_PAD[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk_PAD}] -max -add_delay [get_ports {input_PAD[0]}]
set_input_delay 0.0000 -clock [get_clocks {clk_PAD}] -min -add_delay [get_ports {rst_n_PAD}]
set_input_delay 4.0000 -clock [get_clocks {clk_PAD}] -max -add_delay [get_ports {rst_n_PAD}]
set_output_delay 4.0000 -clock [get_clocks {clk_PAD}] -add_delay [get_ports {bidir_PAD[0]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {clk_PAD}]
set_load -pin_load 0.0729 [get_ports {rst_n_PAD}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[41]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[40]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[39]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[38]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[37]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[36]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[35]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[34]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[33]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[32]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[31]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[30]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[29]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[28]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[27]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[26]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[25]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[24]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[23]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[22]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[21]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[20]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[19]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[18]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[17]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[16]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[15]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[14]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[13]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[12]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[11]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[10]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[9]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[8]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[7]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[6]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[5]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[4]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[3]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[2]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[1]}]
set_load -pin_load 0.0729 [get_ports {bidir_PAD[0]}]
set_load -pin_load 0.0729 [get_ports {input_PAD[11]}]
set_load -pin_load 0.0729 [get_ports {input_PAD[10]}]
set_load -pin_load 0.0729 [get_ports {input_PAD[9]}]
set_load -pin_load 0.0729 [get_ports {input_PAD[8]}]
set_load -pin_load 0.0729 [get_ports {input_PAD[7]}]
set_load -pin_load 0.0729 [get_ports {input_PAD[6]}]
set_load -pin_load 0.0729 [get_ports {input_PAD[5]}]
set_load -pin_load 0.0729 [get_ports {input_PAD[4]}]
set_load -pin_load 0.0729 [get_ports {input_PAD[3]}]
set_load -pin_load 0.0729 [get_ports {input_PAD[2]}]
set_load -pin_load 0.0729 [get_ports {input_PAD[1]}]
set_load -pin_load 0.0729 [get_ports {input_PAD[0]}]
set_driving_cell -lib_cell gf180mcu_fd_io__in_s -pin {PAD} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_PAD}]
set_driving_cell -lib_cell gf180mcu_fd_io__in_c -pin {PAD} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n_PAD}]
set_driving_cell -lib_cell gf180mcu_fd_io__bi_24t -pin {PAD} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bidir_PAD[0]}]
set_driving_cell -lib_cell gf180mcu_fd_io__in_c -pin {PAD} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {input_PAD[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
